app/views/events/index.html.erb

SELECT "events".* FROM "events"
---
  <h2>Sklounge Events: Year <%= Date.today.year %></h2><br/>
     <% Event.month_list.each do |k,v| %>