app/controllers/bulletins_controller.rb

SELECT "bulletins".* FROM "bulletins"
---
  def index
    @bulletins = Bulletin.all

SELECT "bulletins".* FROM "bulletins" WHERE ("bulletins"."id" = 1) LIMIT 1
---
  def show
    @bulletin = Bulletin.find(params[:id])

INSERT INTO "bulletins" ("created_at", "message", "title", "updated_at") VALUES ('2010-09-11 05:59:48.157425', 'dfsffsfjsdfjfjsfsfjffiijfffjdfssdsssssssfffdfffffffffffffffffffffffffffffffffffffffffffffffffwwwwwwwwwwwwwwwwwwweeeeeeeeeeeeeeeelllllllllllllllllllcccccccccccccccxxxxxxxxxxxxxxx', 'Monster', '2010-09-11 05:59:48.157425')
---
  def create
    @bulletin = Bulletin.new(params[:bulletin])
    if @bulletin.save

SELECT "bulletins".* FROM "bulletins" WHERE ("bulletins"."id" = 1) LIMIT 1
---
  def edit
    @bulletin = Bulletin.find(params[:id])

SELECT "bulletins".* FROM "bulletins" WHERE ("bulletins"."id" = 1) LIMIT 1
UPDATE "bulletins" SET "message" = 'providing the best parties availbale to the public,each bring its on mix of beauty and inspirations to the floor,join us at sklounge to be part of this.
---
  def update
    @bulletin = Bulletin.find(params[:id])
    if @bulletin.update_attributes(params[:bulletin])

SELECT "bulletins".* FROM "bulletins" WHERE ("bulletins"."id" = 1) LIMIT 1
DELETE FROM "bulletins" WHERE ("bulletins"."id" = 1)
---
  def destroy
    @bulletin = Bulletin.find(params[:id])
    @bulletin.destroy