app/controllers/contacts_controller.rb

SELECT "contacts".* FROM "contacts" WHERE ("contacts"."id" = 1) LIMIT 1
---
  def show
    @contact = Contact.find(params[:id])

INSERT INTO "contacts" ("created_at", "email", "full_name", "message", "subject", "updated_at") VALUES ('2010-10-23 21:14:54.838139', 'trinox3000@yahoo.com', 'Alexander', 'sdfdsdsssds', 'Kick U off', '2010-10-23 21:14:54.838139')
---
  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save

SELECT "contacts".* FROM "contacts" WHERE ("contacts"."id" = 1) LIMIT 1
DELETE FROM "contacts" WHERE ("contacts"."id" = 1)
---
  def destroy
    @contact = Contact.find(params[:id])
    @contact.destroy