app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE ("events"."id" = 1) LIMIT 1
---
  def show
    @event = Event.find(params[:id])

SELECT "events".* FROM "events" WHERE ("events"."id" = 2) LIMIT 1
---
  def edit
    @event = Event.find(params[:id])

INSERT INTO "events" ("created_at", "event_date", "event_name", "event_time", "updated_at") VALUES ('2010-10-13 20:06:04.335818', '2010-10-13', 'velvet brum', 10, '2010-10-13 20:06:04.335818')
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

SELECT "events".* FROM "events" WHERE ("events"."id" = 2) LIMIT 1
UPDATE "events" SET "event_end_date" = '2010-11-21', "event_start_date" = '2010-11-21' WHERE ("events"."id" = 1)
---
  def update
    @event = Event.find(params[:id])

    respond_to do |format|
      if @event.update_attributes(params[:event])

SELECT "events".* FROM "events" WHERE ("events"."id" = 1) LIMIT 1
DELETE FROM "events" WHERE ("events"."id" = 1)
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy