app/controllers/galleries_controller.rb

  def index
    @galleries = Gallery.all
---
SELECT "galleries".* FROM "galleries"

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 1) LIMIT 1

  def create
    @gallery = Gallery.new(params[:gallery])
    if @gallery.save
---
INSERT INTO "galleries" ("created_at", "description", "gallery_type", "photo_content_type", "photo_file_name", "photo_file_size", "photo_updated_at", "title", "updated_at") VALUES ('2010-09-29 19:14:15.038327', 'love party', 'Events', 'image/jpeg', 'kv_live300x250.jpg', 32796, '2010-09-29 19:14:14.521714', 'Pasty', '2010-09-29 19:14:15.038327')

  def destroy
    @gallery = Gallery.find(params[:id])
    @gallery.destroy
---
SELECT "galleries".* FROM "galleries" WHERE ("galleries"."id" = 1) LIMIT 1
DELETE FROM "galleries" WHERE ("galleries"."id" = 1)