app/controllers/lounges_controller.rb

  def index
   @bulletins = show_Bulletin
   @static = Static.find_active
---
SELECT "statics".* FROM "statics" WHERE ( static_active ='Yes') LIMIT 1