app/controllers/reservations_controller.rb

  def show
    @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE ("reservations"."id" = 1) LIMIT 1

  def edit
   @submitname='   Update   '
    @reservation = Reservation.find(params[:id])
---
SELECT "reservations".* FROM "reservations" WHERE ("reservations"."id" = 2) LIMIT 1

  def create
    @reservation = Reservation.new(params[:reservation])

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("created_at", "email", "extra_msg", "first_name", "last_name", "number_of_guest", "phone_number", "reservation_date", "reservation_time", "table_reservation", "updated_at") VALUES ('2010-09-11 05:54:12.103269', 'trinoxf@gmail.com', '', 'alex', 'Ewetumo', '0943422334', 8034802252, '2010-09-11', '7pm', 'Yes', '2010-09-11 05:54:12.103269')

  def destroy
    @reservation = Reservation.find(params[:id])
    @reservation.destroy
---
SELECT "reservations".* FROM "reservations" WHERE ("reservations"."id" = 1) LIMIT 1
DELETE FROM "reservations" WHERE ("reservations"."id" = 1)