app/controllers/statics_controller.rb

  def show
    @static = Static.find(params[:id])
---
SELECT "statics".* FROM "statics" WHERE ("statics"."id" = 1) LIMIT 1

  def edit
    @static = Static.find(params[:id])
---
SELECT "statics".* FROM "statics" WHERE ("statics"."id" = 1) LIMIT 1

  def create
    @static = Static.new(params[:static])

    respond_to do |format|
      if @static.save
---
INSERT INTO "statics" ("contact_desc", "created_at", "show_desc", "static_active", "updated_at") VALUES ('We here at sklounge understand how important our customers are to us and we believe we do go as far as needed in our own way beyond providing the best service we can but we also understand that no one is perfect therefore we provide you below a space to express to us your problems, recommendations and requests and we will immediately return to you as needed.So get in touch,we are here to serve.', '2010-10-24 15:15:01.888216', 'We here at SKLounge warmly welcome you to our site,where we provide you with the best services needed to adequately meet your needs with the best varieties of cuisines,space and service.We also provide you a immediate location to easily make your reservations with us.So explore and join us here at SKlounge.', 'Yes', '2010-10-24 15:15:01.888216')

  def update
    @static = Static.find(params[:id])

    respond_to do |format|
      if @static.update_attributes(params[:static])
---
SELECT "statics".* FROM "statics" WHERE ("statics"."id" = 1) LIMIT 1
UPDATE "statics" SET "contact_desc" = 'We here at sklounge understand how important our customers are to us and we believe we do go as far as needed in our own way beyond providing the best service we can but we also understand that no one is perfect therefore we provide you below a space to express to us your problems, recommendations and requests and we will immediately return to you as needed.So get in touch,we are here to serve.', "show_desc" = 'We here at SKLounge warmly welcome you to our site,where we provide you with the best services needed to adequately meet your needs with the best varieties of cuisines,space and service.We also provide you here a immediate location to easily make your reservations with us.So explore our new site,check our gallery to see the beautiful dishes and people you can join here and events page to see whats new and upcoming and join us here at SKlounge.', "updated_at" = '2010-10-24 15:22:17.653568' WHERE ("statics"."id" = 1)

  def destroy
    @static = Static.find(params[:id])
    @static.destroy
---
SELECT "statics".* FROM "statics" WHERE ("statics"."id" = 1) LIMIT 1
DELETE FROM "statics" WHERE ("statics"."id" = 1)