app/controllers/users_controller.rb

SELECT "statics".* FROM "statics"
---
  def index
   @users = User.all
   @static = Static.all