app/controllers/users_controller.rb

  def index
   @users = User.find :all
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def show
  @user=User.find params[:id]
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def create
    @user = User.new(params[:user])
    respond_to do |format|
     if @user.save
---
INSERT INTO "users" ("created_at", "crypted_password", "email", "login", "password_salt", "persistence_token", "updated_at", "user_type") VALUES ('2010-09-11 05:58:29.385192', '7a3dabab521a5756a9c042fb07f29a375b6970d54a39e066e653788d3ae6fbc5c3faaca7fa694340536a4b5ad77cba8c936e889d87dd2b43dc1accf6bc53b9ff', 'trinoxf@gmail.com', 'influx', 'Y0CMScXNb91puYFRTdY', '8d03ade9cbc5917e1a32731598c9e6becaf6c5e8fc44c261709db0b243e3d8268e0a288568c73f535a88b46d8b8466c22af3c658e3fbfd3c5fbc3c65f0af8851', '2010-09-11 05:58:29.385192', NULL)

  def edit
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1

  def destroy
  @user=User.find params[:id]
  @user.destroy
---
SELECT "users".* FROM "users" WHERE ("users"."id" = 1) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 1)